In [1]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\hp\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\hp\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\hp\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)

In [2]:
!pip install pymysql

Collecting pymysql
  Downloading pymysql-1.1.2-py3-none-any.whl.metadata (4.3 kB)
Downloading pymysql-1.1.2-py3-none-any.whl (45 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.2

In [1]:
pip show sqlalchemy | grep Version

Note: you may need to restart the kernel to use updated packages.

'grep' is not recognized as an internal or external command,
operable program or batch file.

In [2]:
pip install --upgrade sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\hp\anaconda3\lib\site-packages (2.0.34)
Collecting sqlalchemy
  Downloading sqlalchemy-2.0.44-cp312-cp312-win_amd64.whl.metadata (9.8 kB)
Requirement already satisfied: greenlet>=1 in c:\users\hp\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\hp\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Downloading sqlalchemy-2.0.44-cp312-cp312-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 2.1/2.1 MB 19.9 MB/s eta 0:00:00
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.34
    Uninstalling SQLAlchemy-2.0.34:
      Successfully uninstalled SQLAlchemy-2.0.34
Successfully installed sqlalchemy-2.0.44
Note: you may need to restart the kernel to use updated packages.

In [42]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine, text
import getpass  # To get the password without showing the input
password = getpass.getpass()

 ········

In [ ]:
## While entering my mysql password, I hade to replace the @ in my password with %40

In [43]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [73]:
def rentals_month(engine, month:int,year: int):
    with engine.connect() as connection:
        txt = """ SELECT *, DATE_FORMAT(rental_date, '%Y') AS rental_year, RIGHT(DATE_FORMAT(rental_date, '%m'),1) AS rental_month FROM rental
        WHERE
            DATE_FORMAT(rental_date, '%Y') = :year_param AND
            DATE_FORMAT(rental_date, '%m') = :month_param; 
        ; """
        query = text(txt)
        params = {
                "year_param": year, 
                "month_param": month
            }
        result = connection.execute(query,params)
        return (pd.DataFrame(result.all()))

In [214]:
check=rentals_month(engine, 5,2005)
check

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,rental_year,rental_month
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2005,5
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2005,5
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,2005,5
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,2005,5
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,2005,5
...,...,...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53,2005,5
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53,2005,5
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53,2005,5
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53,2005,5
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,2005,5

In [153]:
def rental_count_month(data:pd.DataFrame, month:int, year:int,):
    
    kk=data.groupby("customer_id").agg({"rental_id":"count"}).reset_index()
    cc=f"rentals_{month}_{year}"
    ff=kk.rename(columns={"rental_id":cc})
    return ff

In [154]:
rental_count_month(check,5,2005)

     customer_id  rentals_5_2005
0              1               2
1              2               1
2              3               2
3              5               3
4              6               3
..           ...             ...
515          594               4
516          595               1
517          596               6
518          597               2
519          599               1

[520 rows x 2 columns]

In [162]:
check2=rentals_month(engine, 2,2006)
check2

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,rental_year,rental_month
0,11496,2006-02-14 15:16:03,2047,155,None,1,2006-02-15 21:30:53,2006,2
1,11541,2006-02-14 15:16:03,2026,335,None,1,2006-02-15 21:30:53,2006,2
2,11563,2006-02-14 15:16:03,1545,83,None,1,2006-02-15 21:30:53,2006,2
3,11577,2006-02-14 15:16:03,4106,219,None,2,2006-02-15 21:30:53,2006,2
4,11593,2006-02-14 15:16:03,817,99,None,1,2006-02-15 21:30:53,2006,2
...,...,...,...,...,...,...,...,...,...
177,15862,2006-02-14 15:16:03,925,215,None,1,2006-02-15 21:30:53,2006,2
178,15867,2006-02-14 15:16:03,837,505,None,2,2006-02-15 21:30:53,2006,2
179,15875,2006-02-14 15:16:03,3611,41,None,1,2006-02-15 21:30:53,2006,2
180,15894,2006-02-14 15:16:03,4416,168,None,1,2006-02-15 21:30:53,2006,2
181,15966,2006-02-14 15:16:03,4472,374,None,1,2006-02-15 21:30:53,2006,2

In [167]:
rental_count_month(check2,2,2006)

     customer_id  rentals_2_2006
0              5               1
1              9               1
2             11               1
3             14               1
4             15               2
..           ...             ...
153          587               1
154          590               1
155          592               1
156          596               1
157          597               1

[158 rows x 2 columns]

In [210]:
def compare_rentals(data1,data2):
    kk=pd.merge(data1,data2, on="customer_id")
    kk["difference"]=kk.iloc[:, 1]-kk.iloc[:, 2]
    return kk

In [212]:
data1=rental_count_month(check,5,2005)
data2=rental_count_month(check2,2,2006)

In [213]:
compare_rentals(data1,data2)

     customer_id  rentals_5_2005  rentals_2_2006  difference
0              5               3               1           2
1              9               3               1           2
2             11               1               1           0
3             14               5               1           4
4             21               3               1           2
..           ...             ...             ...         ...
134          582               1               1           0
135          587               2               1           1
136          590               1               1           0
137          596               6               1           5
138          597               2               1           1

[139 rows x 4 columns]